In [1]:
1+1

2

In [3]:
import numpy as np
import pandas as pd

In [6]:
country = ['India','USA', 'Japan', 'South Korea']
pd.Series(country)

0          India
1            USA
2          Japan
3    South Korea
dtype: object

In [8]:
runs = [100, 200, 300, 400]
pd.Series(runs,dtype='int32')

0    100
1    200
2    300
3    400
dtype: int32

In [9]:
marks = [90, 80, 70, 60]
subjects = ['Math', 'Science', 'English', 'History']
pd.Series(marks, index=subjects)

Math       90
Science    80
English    70
History    60
dtype: int64

In [11]:
pd.Series(marks, index=subjects,name = 'Souvik marks')

Math       90
Science    80
English    70
History    60
Name: Souvik marks, dtype: int64

In [16]:
marks = {
    'Math': 90,
    'Science': 80,
    'English': 70,
    'History': 60
}

marks_series = pd.Series(marks)
print(marks_series)

Math       90
Science    80
English    70
History    60
dtype: int64

In [17]:
marks_series.size

4

In [18]:
marks_series.dtype

dtype('int64')

In [19]:
marks_series.name

In [20]:
pd.Series([1,1,2,3]).is_unique

False

In [21]:
marks_series.index

Index(['Math', 'Science', 'English', 'History'], dtype='object')

In [22]:
marks_series.values

array([90, 80, 70, 60])

In [80]:
subs = pd.read_csv(r'D:\AI\Pandas\subs.csv')
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [33]:
pd.read_csv('D:\AI\Pandas\subs.csv')

<>:1: SyntaxWarning: invalid escape sequence '\A'
<>:1: SyntaxWarning: invalid escape sequence '\A'
C:\Users\souvi\AppData\Local\Temp\ipykernel_10820\648876259.py:1: SyntaxWarning: invalid escape sequence '\A'
  pd.read_csv('D:\AI\Pandas\subs.csv')

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

In [45]:
vk = pd.read_csv('D:\AI\Pandas\kohli_ipl.csv',index_col='match_no')

<>:1: SyntaxWarning: invalid escape sequence '\A'
<>:1: SyntaxWarning: invalid escape sequence '\A'
C:\Users\souvi\AppData\Local\Temp\ipykernel_10820\4137453942.py:1: SyntaxWarning: invalid escape sequence '\A'
  vk = pd.read_csv('D:\AI\Pandas\kohli_ipl.csv',index_col='match_no')

In [51]:
movies = pd.read_csv(r'D:\AI\Pandas\bollywood.csv', index_col='movie').squeeze()

In [42]:
subs.head()

   Subscribers gained
0                  48
1                  57
2                  40
3                  43
4                  44

In [43]:
subs.head(3)

   Subscribers gained
0                  48
1                  57
2                  40

In [46]:
vk.head(10)

          runs
match_no
1            1
2           23
3           13
4           12
5            1
6            9
7           34
8            0
9           21
10           3

In [47]:
vk.tail(10)

          runs
match_no
206          0
207          0
208          9
209         58
210         30
211          0
212         20
213         73
214         25
215          7

In [55]:
vk.sample()

          runs
match_no
210         30

In [50]:
vk.sample(5)

          runs
match_no
108         48
90           4
119         80
57          57
8            0

In [52]:
movies.value_counts()

lead
Akshay Kumar            48
Amitabh Bachchan        45
Ajay Devgn              38
Salman Khan             31
Sanjay Dutt             26
                        ..
Tanishaa Mukerji         1
Tanuja                   1
Ankit                    1
Rakhee Gulzar            1
Geetika Vidya Ohlyan     1
Name: count, Length: 566, dtype: int64

In [56]:
vk.sort_values(by='runs', ascending=False)

          runs
match_no
128        113
126        109
123        108
120        100
164        100
...        ...
93           0
130          0
206          0
207          0
211          0

[215 rows x 1 columns]

In [62]:
vk.sort_values(by='runs', ascending=False).head(1).values[0]

array([113])

In [65]:
vk.sort_values(by='runs', inplace=True)

In [66]:
vk

          runs
match_no
8            0
87           0
93           0
91           0
206          0
...        ...
164        100
120        100
123        108
126        109
128        113

[215 rows x 1 columns]

In [67]:
movies.sort_index(inplace=True)

In [68]:
movies

movie
1920 (film)                   Rajniesh Duggall
1920: London                     Sharman Joshi
1920: The Evil Returns             Vicky Ahuja
1971 (2007 film)                Manoj Bajpayee
2 States (2014 film)              Arjun Kapoor
                                   ...
Zindagi 50-50                      Veena Malik
Zindagi Na Milegi Dobara        Hrithik Roshan
Zindagi Tere Naam           Mithun Chakraborty
Zokkomon                       Darsheel Safary
Zor Lagaa Ke...Haiya!            Meghan Jadhav
Name: lead, Length: 1500, dtype: object

In [69]:
vk.count()

runs    215
dtype: int64

In [70]:
subs.sum()

Subscribers gained    49510
dtype: int64

In [71]:
subs.product()

Subscribers gained    0
dtype: int64

In [72]:
subs.mean()

Subscribers gained    135.643836
dtype: float64

In [73]:
vk.median()

runs    24.0
dtype: float64

In [74]:
subs.std()

Subscribers gained    62.675023
dtype: float64

In [75]:
vk.var()

runs    688.002478
dtype: float64

In [76]:
subs.max()

Subscribers gained    396
dtype: int64

In [77]:
subs.min()

Subscribers gained    33
dtype: int64

In [78]:
vk.describe()

             runs
count  215.000000
mean    30.855814
std     26.229801
min      0.000000
25%      9.000000
50%     24.000000
75%     48.000000
max    113.000000

In [79]:
subs.describe()

       Subscribers gained
count          365.000000
mean           135.643836
std             62.675023
min             33.000000
25%             88.000000
50%            123.000000
75%            177.000000
max            396.000000

In [84]:
vk[:-1]

          runs
match_no
8            0
87           0
93           0
91           0
206          0
...        ...
82          99
164        100
120        100
123        108
126        109

[214 rows x 1 columns]

In [83]:
# Let's understand the overflow issue
print("Data info:")
print(f"Number of rows: {len(subs)}")
print(f"Data type: {subs['Subscribers gained'].dtype}")
print(f"Min value: {subs.min().values[0]}")
print(f"Max value: {subs.max().values[0]}")

# Calculate product using numpy with different data types
import numpy as np

# First few values to see what's happening
print(f"\nFirst 10 values: {subs['Subscribers gained'].head(10).tolist()}")

# Product of just first 10 values
first_10_product = subs['Subscribers gained'].head(10).product()
print(f"Product of first 10 values: {first_10_product}")

# The issue: multiplying 365 positive integers will result in a HUGE number
# that exceeds the limits of standard integer types, causing overflow to 0
print(f"\nThis is an integer overflow issue!")
print(f"When you multiply 365 positive numbers, the result becomes astronomically large")
print(f"and exceeds the maximum value that can be stored in a 64-bit integer.")

# Let's try with float64 to see if we get a result (though it will be huge)
product_float = subs['Subscribers gained'].astype('float64').product()
print(f"Product using float64: {product_float}")

# For comparison, let's see what happens with smaller subsets
print(f"\nProduct of first 5 values: {subs['Subscribers gained'].head(5).product()}")
print(f"Product of first 15 values: {subs['Subscribers gained'].head(15).product()}")
print(f"Product of first 20 values: {subs['Subscribers gained'].head(20).product()}")

Data info:
Number of rows: 365
Data type: int64
Min value: 33
Max value: 396

First 10 values: [48, 57, 40, 43, 44, 46, 33, 40, 44, 74]
Product of first 10 values: 40936751397273600

This is an integer overflow issue!
When you multiply 365 positive numbers, the result becomes astronomically large
and exceeds the maximum value that can be stored in a 64-bit integer.
Product using float64: inf

Product of first 5 values: 207060480
Product of first 15 values: 1630768422724829184
Product of first 20 values: -5411669889746206720

C:\Users\souvi\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.13_qbz5n2kfra8p0\LocalCache\local-packages\Python313\site-packages\numpy\_core\_methods.py:56: RuntimeWarning: overflow encountered in reduce
  return umr_prod(a, axis, dtype, out, keepdims, initial, where)

In [85]:
movies[::2]

movie
1920 (film)                 Rajniesh Duggall
1920: The Evil Returns           Vicky Ahuja
2 States (2014 film)            Arjun Kapoor
3 A.M. (2014 film)             Salil Acharya
3 Idiots                          Aamir Khan
                                  ...
Zero (2018 film)              Shah Rukh Khan
Zila Ghaziabad                  Vivek Oberoi
Zindaggi Rocks                  Sushmita Sen
Zindagi Na Milegi Dobara      Hrithik Roshan
Zokkomon                     Darsheel Safary
Name: lead, Length: 750, dtype: object

In [86]:
marks_series

Math       90
Science    80
English    70
History    60
dtype: int64

In [87]:
marks_series[1] = 100

C:\Users\souvi\AppData\Local\Temp\ipykernel_10820\3104910507.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  marks_series[1] = 100

In [88]:
marks_series

Math        90
Science    100
English     70
History     60
dtype: int64

In [90]:
# Fix: Only use valid indices (0, 2, 3)
marks_series[[0, 2, 3]] = [50, 50, 50]

C:\Users\souvi\AppData\Local\Temp\ipykernel_10820\1918120567.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  marks_series[[0, 2, 3]] = [50, 50, 50]

In [91]:
marks_series

Math        50
Science    100
English     50
History     50
dtype: int64

In [94]:
vk

          runs
match_no
8            0
87           0
93           0
91           0
206          0
...        ...
164        100
120        100
123        108
126        109
128        113

[215 rows x 1 columns]

In [95]:
vk >= 50

           runs
match_no
8         False
87        False
93        False
91        False
206       False
...         ...
164        True
120        True
123        True
126        True
128        True

[215 rows x 1 columns]

In [97]:
vk[vk >= 50].size

215

In [99]:
vk[vk==0].size

215